#1.Определить, имеется ли среди чисел a b c хотя бы одна пара взаимно противоположных чисел.
#2.Известно, что из четырех чисел a1 a2 a3 a4 одно отлично от трех других, равных между собой. Присвоить номер этого числа переменной n

def retab1():
    a = int(input("введите число 1 "))
    b = int(input("введите число 2 "))
    c = int(input("введите число 3 "))
    if a + b == 0 and a != b:
        print("число a ", a, " и  число b ", b, " взаимно противоположны ")
    elif b + c == 0 and b != c:
        print("число b ", b, " и  число c ", c, " взаимно противоположны")
    elif a + c == 0 and a != c:
        print("число a ", a, " и  число c ", c, " взаимно противоположны")
    else:
        print("нет взаимно противоположных чисел")

#retab1()

def retab2():
    n = 0 
    a1 = int(input("введите число 1 "))
    a2 = int(input("введите число 2 "))
    a3 = int(input("введите число 3 "))
    a4 = int(input("введите число 4 "))
    if a2 + a3 + a4 != 3*a1 and a2 + a3 + a4 == 3*a2:
        n = 1
        print("число a1 отлично от других, n = ", n) 
    elif a1 + a3 + a4 != 3*a2 and a1 + a3 + a4 == 3*a1:  
        n = 2
        print("число a2 отлично от других, n = ", n)4
    elif a1 + a2 + a4 != 3*a3 and a1 + a2 + a4 == 3*a1:
        n = 3
        print("число a3 отлично от других, n = ", n)
    elif a1 + a2 + a3 != 3*a4 and a1 + a2 + a3 == 3*a1:
        n = 4
        print("число a4 отлично от других, n = ", n)          
    else:
        print("нет отличных чисел")

retab2()

